Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If you find what you think is a bug, you might check the articles recently posted to the comp.lang.perl.misc newsgroup and the perl bug database at http://rt.perl.org/rt3/ . There may also be information at http://www.perl.org/ , the Perl Home Page.
es_es: Si encuentra algo que piensa que es un error, podría verificar los artículos publicados recientemente en el grupo de noticias comp.lang.perl.misc y la base de datos de errores de perl en http://rt.perl.org/rt3/ . Hay también información en la página principal de Perl, http://www.perl.org/ .

source: means to use Unicode rules when pattern matching.
es_es: significa que use las reglas Unicode en la coincidencia de patrones.

source: Dynamic linker flags have been tweaked for Solaris and OS X, which should solve problems seen while building some XS modules.
es_es: Las banderas del enlazador dinámico han sido modificados para Solaris y OS X, lo que debería solucionar los mismos problemas que aparecen en la construcción de algunos módulos XS.

source: Haven't checked this myself.
es_es: No lo he comprobado por mí mismo.

source: Warning: syntactical care is required when sorting the list returned from a function.
es_es: Advertencia: es requerido un cuidado sintáctico cuando se ordena la lista devuelta desde una función.

source: meta = HvMROMETA(stash);
es_es: meta = HvMROMETA(esquema);

source: Perl operators are documented in full in L<perlop>, but here are a few of the most common ones:
es_es: Encontrará información detallada sobre los operadores de Perl en L<perlop>; algunos de los más comunes son:

source: A hash represents a set of key/value pairs:
es_es: Un hash representa un conjunto de pares clave-valor:

source: Still far from perfect, but maybe worth a try.
es_es: Todavía lejos de ser perfecto, pero quizás vale la pena intentarlo.

source: This is mainly useful for constructing bitmaps for C<select> and low-level POSIX tty-handling operations.
es_es: Esto es principalmente útil para construir bitmaps para C<select> y operaciones POSIX de bajo nivel sobre tty.

source: Along with the Perl interpreter itself, the Perl distribution installs a range of utilities on your system.
es_es: Además del intérprete de Perl, la distribución de Perl incluye varias utilidades que se instalan en el sistema;

source: For much more detailed information, please see the documentation for C<stat>.
es_es: Para más información más detallada, por favor consulte la documentación de C<stat>.

source: <<EOF here-doc yes*
es_es: <<EOF doc-empotrado sí*

source: last LINE if /^$/; # exit when done with header
es_es: last LINEA if /^$/; # salir cuando se termine la cabecera

source: You may charge a reasonable copying fee for any distribution of this Package.
es_es: Usted puede cobrar una cuota razonable por las copias por cualquier distribución de este Paquete.

source: This is done as a second pass, after variables are interpolated, so that regular expressions may be incorporated into the pattern from the variables.
es_es: Esto se hace como un segundo paso, después de que las variables son interpoladas, así las expresiones regulares pueden ser incorporadas en patrones desde las variables.

source: See L<perlrun> for details.
es_es: Vea L<perlrun> para más detalles.

source: This strangeness is due to the underlying system calls' definitions.
es_es: Este comportamiento tan extraño es debido a las definiciones subyacentes de las llamadas del sistema.

source: Starting with 5.8.3 we intend to make more frequent maintenance releases, with a smaller number of changes in each.
es_es: A partir de 5.8.3 tenemos la intención de hacer el mantenimiento más frecuente, con un menor número de cambios en cada uno.

source: And C<$^N> contains whatever was matched by the most-recently closed group (submatch).
es_es: Y C<$^N> contiene aquello que coincidía con el más reciente grupo de captura (sub coincidencia).

# print "4: got $1 " if $y =~ /^(D*)(?!123)/;
source: print "4: got $1\n" if $y =~ /^(\D*)(?!123)/;
es_es: print "4: tenemos $1\n" if $y =~ /^(\D*)(?!123)/;

source: Thus, for example, C<(?-p)> will warn when compiled under C<use warnings>; C<(?-d:...)> and C<(?dl:...)> are fatal errors.
es_es: Así, por ejemplo, C<(?-p)> sacará una advertencia cuando sea compilada bajo C<use warnings>; C<(?-d:...)> y C<(?dl:...)> son errores fatales.

source: Resetting C<"A-Z"> is not recommended because you'll wipe out your C<@ARGV> and C<@INC> arrays and your C<%ENV> hash.
es_es: El restablecimiento de C<"A-Z"> no es recomendable porque limpiará sus arrays C<@ARGV> y C<@INC> y su hash C<%ENV>.

source: This step is performed over the finite automaton that was generated during the previous pass.
es_es: Este paso se realiza en el autómata finito que se generó durante la pasada anterior.

source: Most handlers must therefore arrange to actually display the warnings that they are not prepared to deal with, by calling C<warn> again in the handler.
es_es: La mayoría de los controladores, por lo tanto, deben hacer los arreglos necesarios para mostrar las advertencias de las que no están preparados para hacer frente, llamando a C<warn> de nuevo en el controlador.

source: If the C</r> (non-destructive) option is used then it runs the substitution on a copy of the string and instead of returning the number of substitutions, it returns the copy whether or not a substitution occurred.
es_es: Si la opción C</r> (no destructiva) es utilizada, entonces llevará a cabo la sustitución en una copia de la cadena y en lugar de devolver el número de sustituciones, devuelve la copia, haya o no ocurrido una sustitución.

source: open(FOO, "< $file\0")
es_es: open(FOO, "< $archivo\0")

source: @animals[0,1]; # gives ("camel", "llama");
es_es: @animales[0,1]; # devuelve ("camello", "llama");

source: The first character of the name tells you to what sort of data structure it refers.
es_es: El primer carácter del nombre nos dice a qué tipo de estructura de datos se está accediendo.

source: Consider... oh, never mind.
es_es: Considere... ¡oh!, olvídelo.

source: implement IV/UV/NV/long double un/packing with j/J/F/D
es_es: implementar des/empaquetado de IV/UV/NV/long double con j/J/F/D

source: In other words, the default installation no longer breaks the Apple-provided Perl.
es_es: En otras palabras, la instalación por defecto ya no rompe el Perl proporcionado por Apple.

source: my @animals = ("camel", "llama", "owl");
es_es: my @animales = ("camello", "llama", "búho");

source: One bit.
es_es: Un bit.

source: =item socket SOCKET,DOMAIN,TYPE,PROTOCOL X<socket>
es_es: =item socket SOCKET,DOMINIO,TIPO,PROTOCOLO X<socket>

source: =head1 KNOWN PROBLEMS
es_es: =head1 PROBLEMAS CONOCIDOS

source: The value of the C<open> pragma is no longer ignored for three-argument opens.
es_es: El valor del pragma C<open> ya no es ignorado por el open de tres argumentos.

source: perlnetware Perl notes for NetWare
es_es: perlnetware Notas para NetWare

source: Here is an example of backtracking: Let's say you want to find the word following "foo" in the string "Food is on the foo table.":
es_es: Aquí hay un ejemplo de vuelta atrás: Digamos que quiere encontrar la palabra siguiente a "come" en la cadena "En el Comedor Principal el niño come espinacas.":

source: Perl actually stands for Pathologically Eclectic Rubbish Lister, but don't tell anyone I said that.
es_es: En realidad Perl significa Pathologically Eclectic Rubbish Lister (Presentador de basura patológicamente ecléctico), pero nadie debe enterarse de esto :-).

source: $mode = "0644"; chmod $mode, "foo"; # !!!
es_es: $modo = "0644"; chmod $modo, "foo"; # !!!

source: as we know that if the final quote does not match, backtracking will not help.
es_es: ya que sabemos que si la doble comilla final no coincide, no ayudará el dar marcha atrás.

source: will print out:
es_es: imprimirá:

source: Since the null filehandle uses the two argument form of L<perlfunc/open> it interprets special characters, so if you have a script like this:
es_es: Dado que el identificador de archivo nulo utiliza el formato de dos argumentos de L<perlfunc/open>, interpreta los caracteres especiales, así que si tiene un script como este:

source: For more information see L<perlipc>.
es_es: Para más información ver L<perlipc>.

source: perlfaq8 System Interaction
es_es: perlfaq8 Interacción con el sistema

source: Returns C<undef> on error.
es_es: Devuelve C<undef> en caso de error.

source: print "User: ";
es_es: print "Usuario: ";

source: Document purpose, scope and target applications
es_es: Documente el propósito, ámbito y las aplicaciones objetivo

source: @foo = grep(!/^#/, @bar); # weed out comments
es_es: @foo = grep(!/^#/, @bar); # quitar los comentarios

source: If no match has previously succeeded, this will (silently) act instead as a genuine empty pattern (which will always match).
es_es: Si no hubo una coincidencia exitosa, actuará (silenciosamente) como un verdadero patrón vacío (que siempre coincidirá con cualquier cadena).

source: d Use Unicode or native charset, as in 5.12 and earlier
es_es: d Usa conjunto de caracteres Unicode o nativo, como en 5.12 y anteriores

source: =item C<(?!pattern)> X<(?!)> X<look-ahead, negative> X<lookahead, negative>
es_es: =item C<(?!patrón)> X<(?!)> X<consiguiente, negativo> X<consiguiente, negativo>

source: { local $@; # protect existing $@ eval { test_repugnancy() }; # $@ =~ /nefarious/ and die $@; # Perl 5.14 and higher only $@ =~ /nefarious/ and $e = $@;
es_es: { local $@; # protege el actual $@ eval { test_repugnancia() }; # $@ =~ /infame/ and die $@; # solo en Perl 5.14 y superiores $@ =~ /infame/ and $e = $@;

source: The same PLAINTEXT and SALT will always return the same string, but there is no (known) way to get the original PLAINTEXT from the hash.
es_es: Los mismos TEXTOPLANO y SALTO siempre devolverán el mismo string, pero no hay una forma (conocida) de obtener el TEXTOPLANO original desde el hash.

source: With the C-style operators that would have been written like this:
es_es: Con los operadores del estilo del C esto se hubiera escrito así:

source: Note that GCC-2.95.x rev(DG/UX) knows the switch -pthread which allows it to link correctly DG/UX's -lthread library.
es_es: Tenga en cuenta que GCC-2.95.x revisión DG/UX sabe de la opción -pthread, que le permite vincular correctamente la biblioteca -lthread de DG/UX.

source: If any exist, they are bugs and reports are welcome.
es_es: Si los hay, los errores e informes serán bienvenidos.

source: Here it's more effective to use minimal matching to make sure you get the text between a "foo" and the first "bar" thereafter.
es_es: Aquí es más eficaz utilizar una coincidencia mínima para asegurarse de que obtiene el texto entre un "mesa" y el primer "come" después de él.

source: Treats the return value of the code block as the condition.
es_es: Trata el valor de retorno del bloque de código como la condición.

source: Scalar values can be strings, integers or floating point numbers, and Perl will automatically convert between them as required.
es_es: Los valores escalares pueden ser cadenas, enteros o números de punto flotante, y Perl los convertirá de un tipo a otro cuando sea necesario.

source: Exceptions include C<"#"> inside a string or regular expression.
es_es: Excepciones a esto son la inclusión de C<"#"> dentro de una cadena o una expresión regular.

source: printf '<% d>', 12; # prints "< 12>"
es_es: printf '<% d>', 12; # imprime "< 12>"

source: + - . for (LIST) { }, for (a;b;c) { }
es_es: + - . for (LISTA) { }, for (a;b;c) { }

source: Documented that C<when()> treats specially most of the filetest operators
es_es: Documentado que C<when()> trata de forma especial a la mayoría de los operadores de prueba de fichero

source: Returns from a subroutine, C<eval>, or C<do FILE> with the value given in EXPR.
es_es: Regresa de una subrutina, C<eval> o C<do ARCHIVO>, con el valor indicado en EXPR.

source: =item closedir DIRHANDLE X<closedir>
es_es: =item closedir IDENTIFICADOR_DIR X<closedir>

source: This operator makes that kind of operation work on some other string.
es_es: Este operador hace que este tipo de operación trabaje en alguna otra cadena.

source: \PP [3] Match non-P
es_es: \PP [3] Coincide con una no-P

source: Certain operations search or modify the string $_ by default.
es_es: Ciertas operaciones buscan o modifican la cadena $_ por defecto.

source: =head2 Using character classes
es_es: =head2 Usando clases carácter

source: If there is more than one argument in LIST, or if LIST is an array with more than one value, calls execvp(3) with the arguments in LIST.
es_es: Si hay más de un argumento en LISTA, o si LISTA es un array con más de un valor, se llama a execvp(3) con los argumentos de LISTA.

source: C<setlogsock()> will now C<croak()> as documented.
es_es: C<setlogsock()> ahora hará C<croak()> tal como está documentado.

source: # Permissions: read, write, execute, for user, group, others.
es_es: # Permisos: leer, escribir, ejecutar, por usuario, grupo, otros.

source: Juerd Waalboer <#####@juerd.nl>, with the help of many Perl Monks.
es_es: Juerd Waalboer <#####@juerd.nl>, con la ayuda de muchos Perl Monks.

source: $line = readline(*STDIN); # same thing
es_es: $linea = readline(*STDIN); # lo mismo

source: /etc/games is no good, stopped at canasta line 123.
es_es: /etc/games no está bien, parado at canasta line 123.

source: We'll assume that there's a flat file in which each line is a row and each word an element.
es_es: Vamos a suponer que hay un archivo de texto plano en el que cada línea es una fila y cada palabra un elemento.

source: You may snoop on pending developments via the archives at http://www.xray.mpe.mpg.de/mailing-lists/perl5-porters/ and http://archive.develooper.com/perl5-porters@perl.org/ or the news gateway nntp://nntp.perl.org/perl.perl5.porters or its web interface at http://nntp.perl.org/group/perl.perl5.porters , or read the faq at http://dev.perl.org/perl5/docs/p5p-faq.html , or you can subscribe to the mailing list by sending perl5-porters-subscribe@perl.org a subscription request (an empty message with no subject is fine).
es_es: Si desea curiosear los desarrollos pendientes, puede consultar el archivo mensajes de la lista de correo en http://www.xray.mpe.mpg.de/mailing-lists/perl5-porters/ y http://archive.develooper.com/perl5-porters@perl.org/, o el grupo de noticias nntp://nntp.perl.org/perl.perl5.porters (también está disponible a través de una interfaz web en http://nntp.perl.org/group/perl.perl5.porters), o bien leer las preguntas más frecuentes en http://dev.perl.org/perl5/docs/p5p-faq.html. También puede suscribirse a la lista de correo enviando una solicitud de suscripción a perl5-porters-subscribe@perl.org (solo tiene que enviar un mensaje vacío sin asunto).

source: The resulting string is the concatenation of the converted values.
es_es: La cadena resultante es la concatenación de los valores convertidos.

source: "\N{LATIN SMALL LIGATURE FI}" =~ /fi*/i; # Doesn't match!
es_es: "\N{LATIN SMALL LIGATURE FI}" =~ /fi*/i; # ¡No coincide!

source: Flags (except C<"d">) may follow the caret to override it.
es_es: Las banderas (excepto C<"d">) pueden seguir al acento circunflejo para anular el efecto.

source: However, this description is too low-level and makes you think in terms of a particular implementation.
es_es: Sin embargo, esta descripción es de demasiado bajo nivel y te hace pensar en términos de una particular implementación.

source: If a filter has been installed with this method, it will be invoked every time you write a key to a DBM database.
es_es: Si se ha instalado un filtro con este método, se invocará cada vez que se escriba una clave en una base de datos DBM.

source: A new file, F<mathoms.c>, has been added.
es_es: Un nuevo archivo, F<mathoms.c>, ha sido añadido.

source: stat localtime caller SPECIAL VARIABLES
es_es: stat localtime caller VARIABLES ESPECIALES

source: Moreover, inside C<(?{BLOCK})>, C<(?# comment )>, and a C<#>-comment in a C<//x>-regular expression, no processing is performed whatsoever.
es_es: Por otra parte, dentro de C<(?{BLOQUE})>, C<(?# comentario )>, y un C<#>-comentario en una C<//x>-expresión regular, no se realiza ningún tipo de procesamiento.

source: The return code from the filter is ignored.
es_es: Se omite el código de retorno del filtro.

source: a*", $type, $message)>.
es_es: a*", $tipo, $mensaje)>.

source: C</d>, C</u>, C</a>, and C</l>, available starting in 5.14, are called the character set modifiers; they affect the character set semantics used for the regular expression.
es_es: C</d>, C</u>, C</a>, y C</l>, disponibles a partir de 5.14, son llamados modificadores del conjunto de caracteres; afectan a la semántica del conjunto de caracteres utilizado por la expresión regular.

source: If C<useperlio> is C<define>, you have PerlIO; otherwise you don't.
es_es: Si C<useperlio> está C<definido>, tiene PerlIO activado; de lo contrario, no.

source: For example, C<\x{...}> can't have spaces because hexadecimal numbers don't have spaces in them.
es_es: Por ejemplo, C<\x{...}> no puede tener espacios porque los números hexadecimales no contienen espacios.

source: Care should be taken when using the C<no VERSION> form of C<no>.
es_es: Se debe tener cuidado cuando se usa la forma C<no VERSIÓN> de C<no>.

source: add perlpodspec
es_es: añadido perlpodspec

source: Note: When called in list context, $isdst, the last value returned by gmtime, is always C<0>.
es_es: Nota: cuando se le llama en contexto lista, $isdst, el último valor devuelto por gmtime siempre es C<0>.

source: The C<use warnings> pragma (and the B<-w> switch) produces some lovely diagnostics.
es_es: El pragma C<use warnings> (y el modificador B<-w>) produce algunos diagnósticos muy interesantes.

source: C<PerlIO::scalar> now works better with non-default C<$/> settings.
es_es: C<PerlIO::scalar> ahora funciona mejor con opciones no predeterminadas de C<$/>.

source: * Match 0 or more times
es_es: * Coincide con 0 o más veces

source: If you really wanted to do so, however, you could use the construction C<@{[ (some expression) ]}>, but usually a simple C<(some expression)> suffices.
es_es: Sin embargo, si realmente quiere hacer eso, puede usar la construcción C<@{[ (una expresión) ]}>, pero por lo general un simple C<(una expresión)> basta.

source: For XS or embedding debugging purposes, if perl is compiled with C<-DDEBUG_LEAKING_SCALARS_FORK_DUMP> in addition to C<-DDEBUG_LEAKING_SCALARS> then a child process is C<fork>ed just before global destruction, which is used to display the values of any scalars found to have leaked at the end of global destruction.
es_es: Para XS o con fines de depuración embebida, si perl es compilado con C<-DDEBUG_LEAKING_SCALARS_FORK_DUMP>, además de C<-DDEBUG_LEAKING_SCALARS> entonces un proceso hijo es creado con C<fork> justo antes de la destrucción global, y es utilizado para mostrar los valores de cualquier escalar que sea encontrado y que tenga que ser eliminado al final de la destrucción global.

source: This kind of packing can be achieved with C<pack("l!
es_es: Este tipo de empaquetado se puede lograr con C<pack("l!

source: then you can do a non-blocking wait for all pending zombie processes.
es_es: entonces usted puede hacer una espera no bloqueante para todos los procesos zombie pendientes.

source: (?<ADRESS_PAT>....)
es_es: (?<DIRECCIÓN_PAT>....)

source: If PARNO is preceded by a plus or minus sign then it is assumed to be relative, with negative numbers indicating preceding capture groups and positive ones following.
es_es: Si PARNO es precedido por un signo más o menos, entonces se asume que es relativo, con números negativos indicando grupos de captura anteriores, y con positivos a los posteriores.

source: Such desperate behavior triggers a warning if you use the C<use warnings> pragma or the B<-w> flag.
es_es: Tal desesperado comportamiento lanzará un aviso si usa el pragma C<use warnings> o la opción B<-w>.

source: The interpretation of the file permission operators C<-r>, C<-R>, C<-w>, C<-W>, C<-x>, and C<-X> is by default based solely on the mode of the file and the uids and gids of the user.
es_es: La interpretación de los operadores de permisos de archivo C<-r>, C<-R>, C<-w>, C<-W>, C<-x> y C<-X> es por defecto basado sólamente en el modo del archivo y en los uid y gid del usuario.

source: Returns a lowercased version of EXPR.
es_es: Devuelve una versión de EXPR, en minúsculas.

# print "Darwin's First Name is ", $scientists{"Darwin"}, " ";
source: print "Darwin's First Name is ", $scientists{"Darwin"}, "\n";
es_es: print "El nombre de Darwin ", $cientificos{"Darwin"}, "\n";

source: When using Module::Build, this will usually be:
es_es: Al utilizar el Module::Build, suele ser así:

source: Allow files that start with C<=head> on the first line
es_es: Permite que los archivos comiencen con un C<=head> en la primera línea

source: =head2 Regular expressions
es_es: =head2 Expresiones regulares

source: A package statement affects dynamic variables only, including those you've used C<local> on, but I<not> lexical variables, which are created with C<my>, C<state>, or C<our>.
es_es: Una instrucción package afecta sólo a las variables dinámicas, incluyendo las que haya usado con C<local>, pero I<no> a las variables léxicas, que son creadas con C<my>, C<state> o C<our>.

source: See the CPAN FAQ at http://www.cpan.org/misc/cpan-faq.html for answers to the most frequently asked questions about CPAN including how to become a mirror.
es_es: En la sección FAQ (preguntas más frecuentes) de CPAN (en http://www.cpan.org/misc/cpan-faq.html ) encontrará respuestas a las preguntas más frecuentes sobre CPAN (por ejemplo, cómo configurar un servidor reflejado).

# local $SIG{ALARM} = sub { die "Alarm! " };
source: local $SIG{ALARM} = sub { die "Alarm!\n" };
es_es: local $SIG{ALARM} = sub { die "¡Alarma!\n" };

source: See L<perlop/"`STRING`"> for details.
es_es: Ver L<perlop/"`STRING`"> para los detalles.

source: When the inclusion system walks through @INC and encounters a subroutine, this subroutine gets called with two parameters, the first a reference to itself, and the second the name of the file to be included (e.g., "F<Foo/Bar.pm>").
es_es: Cuando el sistema de inclusión recorre C<@INC> y se encuentra con una subrutina, esta subrutina es llamada con dos parámetros; el primero, una referencia a sí mismo; y el segundo, el nombre del archivo que se incluirá (por ejemplo, "F<Foo/Bar.pm>").

source: perlhaiku Perl notes for Haiku
es_es: perlhaiku Notas para Haiku

source: Return true if successful, false on error.
es_es: Devuelve verdadero si tuvo éxito, falso en caso de error.

source: This isn't the case on EBCDIC platforms; see L<perlebcdic/OPERATOR DIFFERENCES> for the complete list of what these sequences mean on both ASCII and EBCDIC platforms.
es_es: Este no es el caso en las plataformas EBCDIC; ver L<perlebcdic/DIFERENCIAS EN LOS OPERADORES> para ver la lista completa del significado de estas secuencias, tanto en las plataformas ASCII como en EBCDIC.

source: =item Optimization of regular expressions X<regexp, optimization>
es_es: =item Optimización de expresiones regulares X<regexp, optimization> X<regexp, optimización>
